In [ ]:
# Install dependencies

import sys
!{sys.executable} -m pip install hdfs

In [1]:
pip install delta-spark

Requirement already satisfied: delta-spark in /opt/conda/lib/python3.10/site-packages (2.2.0)
Requirement already satisfied: pyspark<3.4.0,>=3.3.0 in /usr/local/spark-3.3.0-bin-hadoop3/python (from delta-spark) (3.3.0)
Requirement already satisfied: importlib-metadata>=1.0.0 in /opt/conda/lib/python3.10/site-packages (from delta-spark) (4.11.4)
Requirement already satisfied: zipp>=0.5 in /opt/conda/lib/python3.10/site-packages (from importlib-metadata>=1.0.0->delta-spark) (3.9.0)
Requirement already satisfied: py4j==0.10.9.5 in /opt/conda/lib/python3.10/site-packages (from pyspark<3.4.0,>=3.3.0->delta-spark) (0.10.9.5)
Note: you may need to restart the kernel to use updated packages.

In [8]:
from pyspark.sql import SparkSession
from pyspark.sql import Row
from delta import *

# warehouse_location points to the default location for managed databases and tables
warehouse_location = 'hdfs://hdfs-nn:9000/TrabalhoPL/gold'

builder = SparkSession \
    .builder \
    .appName("Python Spark SQL Hive integration example") \
    .config("spark.sql.warehouse.dir", warehouse_location) \
    .config("hive.metastore.uris", "thrift://hive-metastore:9083") \
    .config("spark.sql.extensions", "io.delta.sql.DeltaSparkSessionExtension") \
    .config("spark.sql.catalog.spark_catalog", "org.apache.spark.sql.delta.catalog.DeltaCatalog") \
    .config("spark.jars.packages", "io.delta:delta-core_2.12:1.0.0") \
    .enableHiveSupport() \

spark = spark = configure_spark_with_delta_pip(builder).getOrCreate()

In [2]:
# create gold database
spark.sql(
    """
    DROP DATABASE IF EXISTS Projeto_gold CASCADE
    """
)
spark.sql(
    """
    create database Projeto_gold location 'hdfs://hdfs-nn:9000/TrabalhoPL/gold/Projeto_gold.db'
    """
)

DataFrame[]

In [9]:
from pyspark.sql.functions import substring, avg, sum

# read recycling from the silver tables
hdfs_path = "hdfs://hdfs-nn:9000/TrabalhoPL/silver/Projeto.db/Tabela_Reciclagem"

recycling = spark\
             .read\
             .load(hdfs_path)

recycling.show()
recycling.printSchema()

+----------+--------+-------------------+----------+--------------------+------------------+----------------+------------------+-----------+
|      Zone|District|Fiscal_Month_Number|Month_Name|Diversion_Rate_Total|Capture_Rate_Paper|Capture_Rate_MGP|Capture_Rate_Total|Fiscal_Year|
+----------+--------+-------------------+----------+--------------------+------------------+----------------+------------------+-----------+
|Brooklyn  |   BKN01|                 10|     April|                13.7|              41.0|            44.3|              42.3|       2016|
|Brooklyn  |   BKN02|                 10|     April|                17.6|              33.2|            55.4|              39.8|       2016|
|Brooklyn  |   BKN03|                 10|     April|                10.9|              30.5|            39.3|              34.1|       2016|
|Brooklyn  |   BKN04|                 10|     April|                13.4|              30.3|            59.3|              42.1|       2016|
|Brooklyn  |   BKN05|                 10|     April|                 9.6|              22.4|            41.6|              30.2|       2016|
|Brooklyn  |   BKN08|                 10|     April|                15.2|              40.1|            55.8|              46.5|       2016|
|Brooklyn  |   BKN09|                 10|     April|                11.7|              31.4|            42.9|              35.8|       2016|
|Brooklyn  |   BKN16|                 10|     April|                 8.2|              21.2|            32.2|              25.7|       2016|
|Brooklyn  |   BKN17|                 10|     April|                13.2|              29.5|            58.0|              40.3|       2016|
|Brooklyn  |   BKS06|                 10|     April|                30.1|              47.4|            85.4|              58.6|       2016|
|Brooklyn  |   BKS07|                 10|     April|                20.4|              47.2|            71.0|              56.2|       2016|
|Brooklyn  |   BKS10|                 10|     April|                24.9|              57.3|            76.2|              64.4|       2016|
|Brooklyn  |   BKS11|                 10|     April|                17.7|              47.3|            65.1|              54.1|       2016|
|Brooklyn  |   BKS12|                 10|     April|                14.4|              47.5|            41.5|              45.0|       2016|
|Brooklyn  |   BKS13|                 10|     April|                13.4|              39.6|            51.9|              44.9|       2016|
|Brooklyn  |   BKS14|                 10|     April|                15.0|              36.9|            57.4|              43.9|       2016|
|Brooklyn  |   BKS15|                 10|     April|                17.6|              48.5|            62.4|              53.8|       2016|
|Brooklyn  |   BKS18|                 10|     April|                15.0|              41.6|            68.4|              51.1|       2016|
|     Bronx|    BX01|                 10|     April|                 6.8|              19.7|            26.8|              22.8|       2016|
|     Bronx|    BX02|                 10|     April|                12.5|              32.3|            54.3|              41.9|       2016|
+----------+--------+-------------------+----------+--------------------+------------------+----------------+------------------+-----------+
only showing top 20 rows

root
 |-- Zone: string (nullable = true)
 |-- District: string (nullable = true)
 |-- Fiscal_Month_Number: integer (nullable = true)
 |-- Month_Name: string (nullable = true)
 |-- Diversion_Rate_Total: float (nullable = true)
 |-- Capture_Rate_Paper: float (nullable = true)
 |-- Capture_Rate_MGP: float (nullable = true)
 |-- Capture_Rate_Total: float (nullable = true)
 |-- Fiscal_Year: integer (nullable = true)

In [10]:
from pyspark.sql.functions import count
gold_recycling = recycling \
    .groupBy("Zone")\
    .agg(
        sum(recycling.Capture_Rate_Paper).alias("Total_Papel"),
        sum(recycling.Capture_Rate_MGP).alias("Total_Vidro_Plastico")
    ) \
   
gold_recycling.toPandas()

            Zone   Total_Papel  Total_Vidro_Plastico
0     Brooklyn    34107.399984          48414.000059
1       Queens    26562.899977          47233.899937
2  Staten Island   6406.499992          11181.599991
3      Manhattan  23585.999977          35775.500013
4          Bronx  18171.499985          30781.999977

In [11]:
# create recycling table in gold
spark.sql(
    """
    DROP TABLE IF EXISTS Projeto_gold.Tabela_Reciclagem
    """
)


spark.sql(
    """
    CREATE EXTERNAL TABLE Projeto_gold.Tabela_Reciclagem (
        Zone VARCHAR(250),
        Total_Papel DOUBLE, 
        Total_Vidro_Plastico DOUBLE
    )
    USING DELTA
    LOCATION 'hdfs://hdfs-nn:9000/TrabalhoPL/gold/Projeto_gold.db/Tabela_Reciclagem/'
    """
)

DataFrame[]

In [12]:
# write to delta table
gold_recycling \
    .write  \
    .format("delta") \
    .mode("overwrite") \
    .save("hdfs://hdfs-nn:9000/TrabalhoPL/gold/Projeto_gold.db/Tabela_Reciclagem/")

In [13]:
# check the results in the table
spark.table("Projeto_gold.Tabela_Reciclagem").toPandas()

            Zone   Total_Papel  Total_Vidro_Plastico
0     Brooklyn    34107.399984          48414.000059
1       Queens    26562.899977          47233.899937
2  Staten Island   6406.499992          11181.599991
3      Manhattan  23585.999977          35775.500013
4          Bronx  18171.499985          30781.999977

In [14]:
spark.sql("""
GENERATE symlink_format_manifest FOR TABLE delta.`hdfs://hdfs-nn:9000/TrabalhoPL/gold/Projeto_gold.db/Tabela_Reciclagem/`
""").show()

++
||
++
++

In [15]:
spark.sql("""
DROP TABLE IF EXISTS Projeto_gold.Tabela_Reciclagem_Presto
""").show()

spark.sql("""
    CREATE EXTERNAL TABLE Projeto_gold.Tabela_Reciclagem_Presto (
        Zone VARCHAR(250),
        Total_Papel DOUBLE, 
        Total_Vidro_Plastico DOUBLE
    )
ROW FORMAT SERDE 'org.apache.hadoop.hive.ql.io.parquet.serde.ParquetHiveSerDe'
STORED AS INPUTFORMAT 'org.apache.hadoop.hive.ql.io.SymlinkTextInputFormat'
OUTPUTFORMAT 'org.apache.hadoop.hive.ql.io.HiveIgnoreKeyTextOutputFormat'
LOCATION 'hdfs://hdfs-nn:9000/TrabalhoPL/gold/Projeto_gold.db/Tabela_Reciclagem/_symlink_format_manifest/'
""").show()

++
||
++
++

++
||
++
++